---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.PowerFactor
source: html/c742092d-774b-b5af-81fe-1c84d71bab86.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.PowerFactor Property

The power factor of analytical equipment load.

## Syntax (C#)
```csharp
public double PowerFactor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for power factor must be between 0 and 1.